{"class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "method_a", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 200], "dtype": "float32", "sparse": false, "name": "method_a"}, "inbound_nodes": []}, {"name": "masking_31", "class_name": "Masking", "config": {"name": "masking_31", "trainable": true, "batch_input_shape": [null, 50, 200], "dtype": "float32", "mask_value": 0}, "inbound_nodes": [[["method_a", 0, 0, {}]]]}, {"name": "metric_a", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "metric_a"}, "inbound_nodes": []}, {"name": "lstm_31", "class_name": "LSTM", "config": {"name": "lstm_31", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["masking_31", 0, 0, {}]]]}, {"name": "dense_61", "class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "units": 12, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["metric_a", 0, 0, {}]]]}, {"name": "concatenate_31", "class_name": "Concatenate", "config": {"name": "concatenate_31", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_31", 0, 0, {}], ["dense_61", 0, 0, {}]]]}, {"name": "dense_62", "class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "units": 4, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]}, {"name": "dropout_31", "class_name": "Dropout", "config": {"name": "dropout_31", "trainable": true, "rate": 0.6, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_62", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_31", 0, 0, {}]]]}], "input_layers": [["method_a", 0, 0], ["metric_a", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}