{"class_name": "Model", "config": {"name": "model_20", "layers": [{"name": "embedding_20_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "embedding_20_input"}, "inbound_nodes": []}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": false, "batch_input_shape": [null, 19], "dtype": "float32", "input_dim": 2132, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 19}, "inbound_nodes": [[["embedding_20_input", 0, 0, {}]]]}, {"name": "conv1d_118_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 1], "dtype": "float32", "sparse": false, "name": "conv1d_118_input"}, "inbound_nodes": []}, {"name": "conv1d_115", "class_name": "Conv1D", "config": {"name": "conv1d_115", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "conv1d_118", "class_name": "Conv1D", "config": {"name": "conv1d_118", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_118_input", 0, 0, {}]]]}, {"name": "conv1d_116", "class_name": "Conv1D", "config": {"name": "conv1d_116", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]]}, {"name": "conv1d_119", "class_name": "Conv1D", "config": {"name": "conv1d_119", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]]}, {"name": "conv1d_117", "class_name": "Conv1D", "config": {"name": "conv1d_117", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_116", 0, 0, {}]]]}, {"name": "conv1d_120", "class_name": "Conv1D", "config": {"name": "conv1d_120", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_119", 0, 0, {}]]]}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_117", 0, 0, {}]]]}, {"name": "flatten_40", "class_name": "Flatten", "config": {"name": "flatten_40", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_120", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_39", 0, 0, {}], ["flatten_40", 0, 0, {}]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "dense_40", "class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_39", 0, 0, {}]]]}], "input_layers": [["embedding_20_input", 0, 0], ["conv1d_118_input", 0, 0]], "output_layers": [["dense_40", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}