{"class_name": "Model", "config": {"name": "model_19", "layers": [{"name": "embedding_19_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "embedding_19_input"}, "inbound_nodes": []}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": false, "batch_input_shape": [null, 19], "dtype": "float32", "input_dim": 2132, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 19}, "inbound_nodes": [[["embedding_19_input", 0, 0, {}]]]}, {"name": "conv1d_112_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 1], "dtype": "float32", "sparse": false, "name": "conv1d_112_input"}, "inbound_nodes": []}, {"name": "conv1d_109", "class_name": "Conv1D", "config": {"name": "conv1d_109", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "conv1d_112", "class_name": "Conv1D", "config": {"name": "conv1d_112", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_112_input", 0, 0, {}]]]}, {"name": "conv1d_110", "class_name": "Conv1D", "config": {"name": "conv1d_110", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_109", 0, 0, {}]]]}, {"name": "conv1d_113", "class_name": "Conv1D", "config": {"name": "conv1d_113", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_112", 0, 0, {}]]]}, {"name": "conv1d_111", "class_name": "Conv1D", "config": {"name": "conv1d_111", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_110", 0, 0, {}]]]}, {"name": "conv1d_114", "class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_113", 0, 0, {}]]]}, {"name": "flatten_37", "class_name": "Flatten", "config": {"name": "flatten_37", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_111", 0, 0, {}]]]}, {"name": "flatten_38", "class_name": "Flatten", "config": {"name": "flatten_38", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_114", 0, 0, {}]]]}, {"name": "concatenate_19", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_37", 0, 0, {}], ["flatten_38", 0, 0, {}]]]}, {"name": "dense_37", "class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"name": "dense_38", "class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_37", 0, 0, {}]]]}], "input_layers": [["embedding_19_input", 0, 0], ["conv1d_112_input", 0, 0]], "output_layers": [["dense_38", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}