{"class_name": "Model", "config": {"name": "model_29", "layers": [{"name": "embedding_29_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "embedding_29_input"}, "inbound_nodes": []}, {"name": "embedding_29", "class_name": "Embedding", "config": {"name": "embedding_29", "trainable": false, "batch_input_shape": [null, 19], "dtype": "float32", "input_dim": 2132, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 19}, "inbound_nodes": [[["embedding_29_input", 0, 0, {}]]]}, {"name": "conv1d_172_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 1], "dtype": "float32", "sparse": false, "name": "conv1d_172_input"}, "inbound_nodes": []}, {"name": "conv1d_169", "class_name": "Conv1D", "config": {"name": "conv1d_169", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_29", 0, 0, {}]]]}, {"name": "conv1d_172", "class_name": "Conv1D", "config": {"name": "conv1d_172", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_172_input", 0, 0, {}]]]}, {"name": "conv1d_170", "class_name": "Conv1D", "config": {"name": "conv1d_170", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_169", 0, 0, {}]]]}, {"name": "conv1d_173", "class_name": "Conv1D", "config": {"name": "conv1d_173", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_172", 0, 0, {}]]]}, {"name": "conv1d_171", "class_name": "Conv1D", "config": {"name": "conv1d_171", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_170", 0, 0, {}]]]}, {"name": "conv1d_174", "class_name": "Conv1D", "config": {"name": "conv1d_174", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_173", 0, 0, {}]]]}, {"name": "flatten_57", "class_name": "Flatten", "config": {"name": "flatten_57", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_171", 0, 0, {}]]]}, {"name": "flatten_58", "class_name": "Flatten", "config": {"name": "flatten_58", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_174", 0, 0, {}]]]}, {"name": "concatenate_29", "class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_57", 0, 0, {}], ["flatten_58", 0, 0, {}]]]}, {"name": "dense_57", "class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"name": "dense_58", "class_name": "Dense", "config": {"name": "dense_58", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_57", 0, 0, {}]]]}], "input_layers": [["embedding_29_input", 0, 0], ["conv1d_172_input", 0, 0]], "output_layers": [["dense_58", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}