{"class_name": "Model", "config": {"name": "model_44", "layers": [{"name": "embedding_44_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "embedding_44_input"}, "inbound_nodes": []}, {"name": "embedding_44", "class_name": "Embedding", "config": {"name": "embedding_44", "trainable": false, "batch_input_shape": [null, 19], "dtype": "float32", "input_dim": 2132, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 19}, "inbound_nodes": [[["embedding_44_input", 0, 0, {}]]]}, {"name": "conv1d_262_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 1], "dtype": "float32", "sparse": false, "name": "conv1d_262_input"}, "inbound_nodes": []}, {"name": "conv1d_259", "class_name": "Conv1D", "config": {"name": "conv1d_259", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_44", 0, 0, {}]]]}, {"name": "conv1d_262", "class_name": "Conv1D", "config": {"name": "conv1d_262", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_262_input", 0, 0, {}]]]}, {"name": "conv1d_260", "class_name": "Conv1D", "config": {"name": "conv1d_260", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_259", 0, 0, {}]]]}, {"name": "conv1d_263", "class_name": "Conv1D", "config": {"name": "conv1d_263", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_262", 0, 0, {}]]]}, {"name": "conv1d_261", "class_name": "Conv1D", "config": {"name": "conv1d_261", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_260", 0, 0, {}]]]}, {"name": "conv1d_264", "class_name": "Conv1D", "config": {"name": "conv1d_264", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_263", 0, 0, {}]]]}, {"name": "flatten_87", "class_name": "Flatten", "config": {"name": "flatten_87", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_261", 0, 0, {}]]]}, {"name": "flatten_88", "class_name": "Flatten", "config": {"name": "flatten_88", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_264", 0, 0, {}]]]}, {"name": "concatenate_44", "class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_87", 0, 0, {}], ["flatten_88", 0, 0, {}]]]}, {"name": "dense_87", "class_name": "Dense", "config": {"name": "dense_87", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}, {"name": "dense_88", "class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_87", 0, 0, {}]]]}], "input_layers": [["embedding_44_input", 0, 0], ["conv1d_262_input", 0, 0]], "output_layers": [["dense_88", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}