{"class_name": "Model", "config": {"name": "model_48", "layers": [{"name": "embedding_48_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "embedding_48_input"}, "inbound_nodes": []}, {"name": "embedding_48", "class_name": "Embedding", "config": {"name": "embedding_48", "trainable": false, "batch_input_shape": [null, 15], "dtype": "float32", "input_dim": 2458, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 15}, "inbound_nodes": [[["embedding_48_input", 0, 0, {}]]]}, {"name": "conv1d_286_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 1], "dtype": "float32", "sparse": false, "name": "conv1d_286_input"}, "inbound_nodes": []}, {"name": "conv1d_283", "class_name": "Conv1D", "config": {"name": "conv1d_283", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_48", 0, 0, {}]]]}, {"name": "conv1d_286", "class_name": "Conv1D", "config": {"name": "conv1d_286", "trainable": true, "batch_input_shape": [null, 2, 1], "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_286_input", 0, 0, {}]]]}, {"name": "conv1d_284", "class_name": "Conv1D", "config": {"name": "conv1d_284", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_283", 0, 0, {}]]]}, {"name": "conv1d_287", "class_name": "Conv1D", "config": {"name": "conv1d_287", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_286", 0, 0, {}]]]}, {"name": "conv1d_285", "class_name": "Conv1D", "config": {"name": "conv1d_285", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_284", 0, 0, {}]]]}, {"name": "conv1d_288", "class_name": "Conv1D", "config": {"name": "conv1d_288", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_287", 0, 0, {}]]]}, {"name": "flatten_95", "class_name": "Flatten", "config": {"name": "flatten_95", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_285", 0, 0, {}]]]}, {"name": "flatten_96", "class_name": "Flatten", "config": {"name": "flatten_96", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_288", 0, 0, {}]]]}, {"name": "concatenate_48", "class_name": "Concatenate", "config": {"name": "concatenate_48", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_95", 0, 0, {}], ["flatten_96", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_48", 0, 0, {}]]]}, {"name": "dense_96", "class_name": "Dense", "config": {"name": "dense_96", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_95", 0, 0, {}]]]}], "input_layers": [["embedding_48_input", 0, 0], ["conv1d_286_input", 0, 0]], "output_layers": [["dense_96", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}